{"class_name": "Model", "config": {"name": "model_12", "layers": [{"name": "input_52", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 130], "dtype": "float32", "sparse": false, "name": "input_52"}, "inbound_nodes": []}, {"name": "input_53", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 130], "dtype": "float32", "sparse": false, "name": "input_53"}, "inbound_nodes": []}, {"name": "embedding_49", "class_name": "Embedding", "config": {"name": "embedding_49", "trainable": false, "batch_input_shape": [null, 130], "dtype": "float32", "input_dim": 95604, "output_dim": 300, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 130}, "inbound_nodes": [[["input_52", 0, 0, {}]]]}, {"name": "embedding_50", "class_name": "Embedding", "config": {"name": "embedding_50", "trainable": false, "batch_input_shape": [null, 130], "dtype": "float32", "input_dim": 95604, "output_dim": 300, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 130}, "inbound_nodes": [[["input_53", 0, 0, {}]]]}, {"name": "lstm_19", "class_name": "LSTM", "config": {"name": "lstm_19", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 100, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["embedding_49", 0, 0, {}]], [["embedding_50", 0, 0, {}]]]}, {"name": "lambda_23", "class_name": "Lambda", "config": {"name": "lambda_23", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAQAAABDAAAAcxIAAAB0AHwAZAEZAHwAZAIZAIMCUwApA07pAAAAAOkBAAAA\nKQHaFmV4cF9tYW5oYXR0YW5fZGlzdGFuY2UpAdoBeKkAcgUAAAD6IDxpcHl0aG9uLWlucHV0LTEx\nMy00MTJhYWZiNjE1ZDI+2gg8bGFtYmRhPhUAAABzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": ["4wEAAAAAAAAAAQAAAAIAAABDAAAAcxAAAAB8AGQBGQBkARkAZAJmAlMAKQNO6QAAAADpAQAAAKkA\nKQHaAXhyAwAAAHIDAAAA+iA8aXB5dGhvbi1pbnB1dC0xMTMtNDEyYWFmYjYxNWQyPtoIPGxhbWJk\nYT4VAAAAcwAAAAA=\n", null, null], "output_shape_type": "lambda", "arguments": {}}, "inbound_nodes": [[["lstm_19", 0, 0, {}], ["lstm_19", 1, 0, {}]]]}], "input_layers": [["input_52", 0, 0], ["input_53", 0, 0]], "output_layers": [["lambda_23", 0, 0]]}, "keras_version": "2.2.5", "backend": "tensorflow"}